Autodesk.Revit.DB.Geolocation.DerivedGeolocation.SetDerivingOperation(Autodesk.Revit.DB.Transform)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.DerivedGeolocation.SetBaseGeolocationReference(Autodesk.Revit.DB.Geolocation.GeolocationBase)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.Geolocation.DerivedGeolocation
Derived